In [2]:
import os 
os.chdir('C:/Users/viswanath_thatha/Downloads/Recomm Systems')

In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sklearn
from sklearn.decomposition import TruncatedSVD
from scipy.sparse import csr_matrix
import warnings
warnings.filterwarnings('ignore',category=RuntimeWarning)

In [9]:
book = pd.read_csv('BX-Books.csv',sep=';',error_bad_lines=False,encoding='latin-1')
users = pd.read_csv('BX-Users.csv',sep=';',error_bad_lines=False,encoding='latin-1')
ratings = pd.read_csv('BX-Book-Ratings.csv',sep=';',error_bad_lines=False,encoding='latin-1')

b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'
b'Skipping line 92038: expected 8 fields, saw 9\nSkipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\n'
b'Skipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\nSkipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'
b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'
C:\Users\viswanath_thatha\AppData\Local\Continuum\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2785: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [15]:
print('book shape', book.shape,'\n')
book.head()

book shape (271360, 8)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [17]:
print(ratings.shape)
ratings.head()

(1149780, 3)

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [19]:
print(users.shape)
users.head()

(278858, 3)

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [28]:
combine_book_rating = pd.merge(ratings,book,on='ISBN')
columns = ['Year-Of-Publication','Publisher', 'Image-URL-S', 'Image-URL-M','Image-URL-L','Book-Author']
combine_book_rating = combine_book_rating.drop(columns,axis=1)
combine_book_rating.head()

   User-ID        ISBN  Book-Rating            Book-Title
0   276725  034545104X            0  Flesh Tones: A Novel
1     2313  034545104X            5  Flesh Tones: A Novel
2     6543  034545104X            0  Flesh Tones: A Novel
3     8680  034545104X            5  Flesh Tones: A Novel
4    10314  034545104X            9  Flesh Tones: A Novel

In [48]:
combine_book_rating = combine_book_rating.dropna(axis=0,subset=['Book-Title'])
combine_book_rating.head()

   User-ID        ISBN  Book-Rating            Book-Title
0   276725  034545104X            0  Flesh Tones: A Novel
1     2313  034545104X            5  Flesh Tones: A Novel
2     6543  034545104X            0  Flesh Tones: A Novel
3     8680  034545104X            5  Flesh Tones: A Novel
4    10314  034545104X            9  Flesh Tones: A Novel

In [47]:
book_rating_count = (combine_book_rating.groupby(by = ['Book-Title'])['Book-Rating'].count().reset_index().rename(columns={'Book-Rating':'totalratingcount'})[['Book-Title','totalratingcount']])
book_rating_count.head()

                                          Book-Title  totalratingcount
0   A Light in the Storm: The Civil War Diary of ...                 4
1                              Always Have Popsicles                 1
2               Apple Magic (The Collector's series)                 1
3   Ask Lily (Young Women of Faith: Lily Series, ...                 1
4   Beyond IBM: Leadership Marketing and Finance ...                 1

In [54]:
rating_with_totalratingcount = combine_book_rating.merge(book_rating_count,left_on='Book-Title',right_on='Book-Title',how='left')
rating_with_totalratingcount.head()

   User-ID        ISBN  Book-Rating            Book-Title  totalratingcount
0   276725  034545104X            0  Flesh Tones: A Novel                60
1     2313  034545104X            5  Flesh Tones: A Novel                60
2     6543  034545104X            0  Flesh Tones: A Novel                60
3     8680  034545104X            5  Flesh Tones: A Novel                60
4    10314  034545104X            9  Flesh Tones: A Novel                60

In [56]:
book_rating_count['totalratingcount'].quantile(np.arange(0.9,1,.01))

0.90     7.0
0.91     8.0
0.92     9.0
0.93    10.0
0.94    11.0
0.95    13.0
0.96    16.0
0.97    20.0
0.98    29.0
0.99    50.0
Name: totalratingcount, dtype: float64

In [58]:
popularity_threshold = 50
rating_popular_book = rating_with_totalratingcount.query('totalratingcount>=@popularity_threshold')
rating_popular_book.head()

   User-ID        ISBN  Book-Rating            Book-Title  totalratingcount
0   276725  034545104X            0  Flesh Tones: A Novel                60
1     2313  034545104X            5  Flesh Tones: A Novel                60
2     6543  034545104X            0  Flesh Tones: A Novel                60
3     8680  034545104X            5  Flesh Tones: A Novel                60
4    10314  034545104X            9  Flesh Tones: A Novel                60

In [65]:
combined = rating_popular_book.merge(users,left_on='User-ID',right_on='User-ID',how='left')
us_canada_user_rating = combined[combined['Location'].str.contains('usa|canada')]
us_canada_user_rating = us_canada_user_rating.drop('Age',axis=1)
us_canada_user_rating.head()

,User-ID,ISBN,Book-Rating,Book-Title,totalratingcount,Location
0,276725,034545104X,0,Flesh Tones: A Novel,60,"tyler, texas, usa"
1,2313,034545104X,5,Flesh Tones: A Novel,60,"cincinnati, ohio, usa"
2,6543,034545104X,0,Flesh Tones: A Novel,60,"strafford, missouri, usa"
3,8680,034545104X,5,Flesh Tones: A Novel,60,"st. charles county, missouri, usa"
4,10314,034545104X,9,Flesh Tones: A Novel,60,"beaverton, oregon, usa"

In [75]:
cols = ['User-ID', 'ISBN', 'Book-Rating', 'Book-Title', 'totalratingcount','Location']
def missing_values(columns):
    for i in columns:
        print('missing value for column',i,'is ', us_canada_user_rating[i].isnull().sum().sum())
missing_values(cols)

missing value for column User-ID is  0
missing value for column ISBN is  0
missing value for column Book-Rating is  0
missing value for column Book-Title is  0
missing value for column totalratingcount is  0
missing value for column Location is  0

In [91]:
us_canada_user_rating1 = us_canada_user_rating.drop_duplicates(['User-ID'])

In [93]:
us_canada_user_rating_pivot = us_canada_user_rating1.pivot(index='User-ID',columns='Book-Title',values='Book-Rating').fillna(0)
us_canada_user_rating_pivot.head()

Book-Title,10 Lb. Penalty,16 Lighthouse Road,1984,1st to Die: A Novel,2010: Odyssey Two,204 Rosewood Lane,2061: Odyssey Three,24 Hours,2nd Chance,3rd Degree,...,YOU BELONG TO ME,Year of Wonders,You Belong To Me,You Shall Know Our Velocity,Young Wives,Zen and the Art of Motorcycle Maintenance: An Inquiry into Values,Zoya,"\O\"" Is for Outlaw""","\Surely You're Joking, Mr. Feynman!\"": Adventures of a Curious Character""",stardust
User-ID,,,,,,,,,,,,,,,,,,,,,
8,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
9,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
14,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
16,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
17,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [94]:
us_canada_user_rating_pivot.shape

(40017, 2398)

In [98]:
X = us_canada_user_rating_pivot.values.T
X.shape

(2398, 40017)

In [99]:
from sklearn.decomposition import TruncatedSVD

SVD = TruncatedSVD(n_components=12)
matrix = SVD.fit_transform(X)
matrix.shape

(2398, 12)

In [100]:
corr = np.corrcoef(matrix)
corr.shape

(2398, 2398)

In [130]:
us_canada_book_list = list(us_canada_user_rating_pivot.columns)
recommend_book = us_canada_book_list.index('16 Lighthouse Road')
print(recommend_book)

1

In [174]:
corr_recommend_book = corr[recommend_book]
corr_recommend_book = [x for x in corr_recommend_book if str(x)!= 'nan']

In [178]:
list(us_canada_book_list[(corr_recommend_book<1.0) & (corr_recommend_book>0.9)])

TypeError: '<' not supported between instances of 'list' and 'float'